In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
data.name="numbers"

In [4]:
data

a    1
b    2
c    3
d    4
e    5
Name: numbers, dtype: int64

In [5]:
data.values

array([1, 2, 3, 4, 5], dtype=int64)

In [6]:
data.shape

(5,)

In [7]:
data["a"]

1

In [8]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
data.loc["a"::2],data.iloc[3]

(a    1
 c    3
 e    5
 Name: numbers, dtype: int64,
 4)

In [12]:
data.loc[["a","c","e"]],data.iloc[3]

(a    1
 c    3
 e    5
 Name: numbers, dtype: int64,
 4)

In [21]:
import pandas as pd
dict={
      "usn":[1,2,3],
      "name":["nameera","habbu","keeru"],
      "age":[21,22,23],
      "branch":["cs","cs","ai"]
}

In [23]:
df=pd.DataFrame(dict)
df

   usn     name  age branch
0    1  nameera   21     cs
1    2    habbu   22     cs
2    3    keeru   23     ai

In [12]:
data=pd.read_csv(r"C:\Users\Admin\Downloads\sample.csv")

In [29]:
data.tail(10)

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [30]:
data.describe()

,Unnamed: 0,EmpID,Age,Salary,Experience,PerformanceScore
count,20.00000,20.00000,20.000000,20.000000,20.000000,20.000000
mean,9.50000,110.50000,32.700000,59875.000000,7.400000,4.190000
std,5.91608,5.91608,5.449288,13388.796377,4.615762,0.415363
min,0.00000,101.00000,25.000000,45000.000000,2.000000,3.500000
25%,4.75000,105.75000,28.750000,50750.000000,4.000000,3.900000
50%,9.50000,110.50000,31.500000,56500.000000,6.000000,4.150000
75%,14.25000,115.25000,36.250000,61250.000000,10.250000,4.425000
max,19.00000,120.00000,45.000000,90000.000000,18.000000,4.900000

In [31]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        20 non-null     int64
 1   EmpID             20 non-null     int64
 2   Name              20 non-null     object
 3   Department        20 non-null     object
 4   Age               20 non-null     int64
 5   Salary            20 non-null     int64
 6   Experience        20 non-null     int64
 7   JoiningDate       20 non-null     object
 8   City              20 non-null     object
 9   PerformanceScore  20 non-null     float64
dtypes: float64(1), int64(5), object(4)
memory usage: 1.7+ KB

In [33]:
data.shape

(20, 10)

In [35]:
data.sample()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3

In [10]:
data [["Name","Department"]].head(2)

NameError: name 'data' is not defined

In [11]:
data[["Name","Age"]]

NameError: name 'data' is not defined

In [13]:
data

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [14]:
data[["Name","Department"]]

     Name Department
0     Ram         IT
1   Shyam         HR
2   Geeta    Finance
3   Anita         IT
4   Kiran         HR
5    John    Finance
6   Meena         IT
7   David         HR
8    Sara    Finance
9   Arjun         IT
10   Ravi         HR
11  Priya    Finance
12  Kunal         IT
13  Sneha         HR
14  Vijay    Finance
15   Neha         IT
16   Amit         HR
17  Pooja    Finance
18  Rahul         IT
19  Divya         HR

In [15]:
data[["Name","Department","Age"]].head(2)

    Name Department  Age
0    Ram         IT   25
1  Shyam         HR   30

In [16]:
type(data.Name)

pandas.core.series.Series

In [3]:
import pandas as pd
data1=pd.read_csv(r"C:\Users\Admin\Downloads\test2.csv")
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [21]:
data1.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [22]:
data1.loc["0":"1","Name":"Department"]

    Name   Age Department
0  Alice  25.0         HR
1    Bob  30.0         IT

In [24]:
data1.loc[1:3,"Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [25]:
data1.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [32]:
data1.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"},inplace=False)

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [33]:
data1

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [35]:
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [39]:
data1.drop('Unnamed: 0',axis=1,inplace=True)

In [40]:
data1

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [43]:
data1["updated_salary"]=data1["Salary"]+10000

In [44]:
data1

      Name   Age Department   Salary  updated_salary
0    Alice  25.0         HR  50000.0         60000.0
1      Bob  30.0         IT  60000.0         70000.0
2  Charlie  35.0    Finance  70000.0         80000.0
3    David   NaN         IT  62000.0         72000.0
4      Eve  29.0         HR      NaN             NaN
5    Alice  25.0         HR  50000.0         60000.0

In [45]:
data1["updated_salary2"]=data1["Salary"].map(lambda x:x+5000)

In [46]:
data1

      Name   Age Department   Salary  updated_salary  updated_salary2
0    Alice  25.0         HR  50000.0         60000.0          55000.0
1      Bob  30.0         IT  60000.0         70000.0          65000.0
2  Charlie  35.0    Finance  70000.0         80000.0          75000.0
3    David   NaN         IT  62000.0         72000.0          67000.0
4      Eve  29.0         HR      NaN             NaN              NaN
5    Alice  25.0         HR  50000.0         60000.0          55000.0

In [48]:
data1[data1["Age"]>25]

      Name   Age Department   Salary  updated_salary  updated_salary2
1      Bob  30.0         IT  60000.0         70000.0          65000.0
2  Charlie  35.0    Finance  70000.0         80000.0          75000.0
4      Eve  29.0         HR      NaN             NaN              NaN

In [49]:
data1.dropna(inplace=True)

In [50]:
data1

      Name   Age Department   Salary  updated_salary  updated_salary2
0    Alice  25.0         HR  50000.0         60000.0          55000.0
1      Bob  30.0         IT  60000.0         70000.0          65000.0
2  Charlie  35.0    Finance  70000.0         80000.0          75000.0
5    Alice  25.0         HR  50000.0         60000.0          55000.0

In [51]:
data1.isnull().sum()

Name               0
Age                0
Department         0
Salary             0
updated_salary     0
updated_salary2    0
dtype: int64

In [53]:
data1["Age"]=data1.Age.astype("int")

In [54]:
data1

      Name  Age Department   Salary  updated_salary  updated_salary2
0    Alice   25         HR  50000.0         60000.0          55000.0
1      Bob   30         IT  60000.0         70000.0          65000.0
2  Charlie   35    Finance  70000.0         80000.0          75000.0
5    Alice   25         HR  50000.0         60000.0          55000.0

In [5]:
 data1["Salary"]=data1["Salary"].fillna(value=data1["Salary"].mean())

In [6]:
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [7]:
 data1["Age"]=data1["Age"].fillna(value=data1["Age"].mean())

In [8]:
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [11]:
data1["Department"].value_counts()

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [12]:
data1["Age"]=data1["Age"].fillna(method="ffill")
data1["Salary"]=data1["Salary"].fillna(method="bfill")

C:\Users\Admin\AppData\Local\Temp\ipykernel_15304\3272932298.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data1["Age"]=data1["Age"].fillna(method="ffill")
C:\Users\Admin\AppData\Local\Temp\ipykernel_15304\3272932298.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data1["Salary"]=data1["Salary"].fillna(method="bfill")

In [13]:
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [14]:
data1.Age.ffill()

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [15]:
 data1["updated_salary"]=data1["Salary"].apply(lambda x:x+500)

In [16]:
data1

   Unnamed: 0     Name   Age Department   Salary  updated_salary
0           0    Alice  25.0         HR  50000.0         50500.0
1           1      Bob  30.0         IT  60000.0         60500.0
2           2  Charlie  35.0    Finance  70000.0         70500.0
3           3    David  28.8         IT  62000.0         62500.0
4           4      Eve  29.0         HR  58400.0         58900.0
5           5    Alice  25.0         HR  50000.0         50500.0

In [18]:
data1["level"]=data1.apply(lambda meh:"high" if meh["Salary"]>60000 else "low",axis=1)

In [19]:
data1

   Unnamed: 0     Name   Age Department   Salary  updated_salary level
0           0    Alice  25.0         HR  50000.0         50500.0   low
1           1      Bob  30.0         IT  60000.0         60500.0   low
2           2  Charlie  35.0    Finance  70000.0         70500.0  high
3           3    David  28.8         IT  62000.0         62500.0  high
4           4      Eve  29.0         HR  58400.0         58900.0   low
5           5    Alice  25.0         HR  50000.0         50500.0   low

In [20]:
data1.groupby("Department")["Salary"].mean()

Department
Finance    70000.0
HR         52800.0
IT         61000.0
Name: Salary, dtype: float64

In [29]:
filtered=data1[(data1["Age"]>28)|(data1["Salary"]>50000)]

In [27]:
filtered

   Unnamed: 0     Name   Age Department   Salary  updated_salary level
1           1      Bob  30.0         IT  60000.0         60500.0   low
2           2  Charlie  35.0    Finance  70000.0         70500.0  high
3           3    David  28.8         IT  62000.0         62500.0  high
4           4      Eve  29.0         HR  58400.0         58900.0   low